# Synthesis script for yosys created by qflow
read_liberty -lib -ignore_miss_dir -setattr blackbox /usr/local/share/pdk/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__ff_n40C_1v95.lib
read_verilog  /home/exotic/Desktop/ASIC_ADC/verilog/source/therm_code_cl.v

# High-level synthesis
synth -top therm
# Map register flops
dfflibmap -liberty /usr/local/share/pdk/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__ff_n40C_1v95.lib
opt

# Map combinatorial cells, standard script
abc -exe /usr/lib/qflow/bin/yosys-abc -liberty /usr/local/share/pdk/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__ff_n40C_1v95.lib -script +strash;scorr;ifraig;retime,{D};strash;dch,-f;map,-M,1,{D}
flatten
setundef -zero

clean -purge
hilomap -hicell sky130_fd_sc_hd__conb_1 HI
hilomap -locell sky130_fd_sc_hd__conb_1 LO
# Output buffering
iopadmap -outpad sky130_fd_sc_hd__buf_1 A:X -bits
# Cleanup
opt
clean
rename -enumerate
write_blif  -buf sky130_fd_sc_hd__buf_1 A X therm_mapped.blif
stat
