###############################################################
#  Generated by:      Cadence Innovus 22.33-s094_1
#  OS:                Linux x86_64(Host ID cae-europractice1.othr.de)
#  Generated on:      Fri Dec 13 19:04:13 2024
#  Design:            adc
#  Command:           saveDesign adc.enc
###############################################################
current_design adc
create_clock [get_ports {clk}]  -name clk -period 1.111100 -waveform {0.000000 0.500000}
set_clock_transition  -rise -min 0.01 [get_clocks {clk}]
set_clock_transition  -rise -max 0.01 [get_clocks {clk}]
set_clock_transition  -fall -min 0.01 [get_clocks {clk}]
set_clock_transition  -fall -max 0.01 [get_clocks {clk}]
set_propagated_clock  [get_ports {clk}]
set_disable_timing   [get_pins {pretherm/Y01}]
set_disable_timing   [get_pins {pretherm/Y02}]
set_disable_timing   [get_pins {pretherm/Y03}]
set_disable_timing   [get_pins {pretherm/Y04}]
set_disable_timing   [get_pins {pretherm/Y05}]
set_disable_timing   [get_pins {pretherm/Y06}]
set_disable_timing   [get_pins {pretherm/Y07}]
set_disable_timing   [get_pins {pretherm/Y08}]
set_disable_timing   [get_pins {pretherm/Y09}]
set_disable_timing   [get_pins {pretherm/Y10}]
set_disable_timing   [get_pins {pretherm/Y11}]
set_disable_timing   [get_pins {pretherm/Y12}]
set_disable_timing   [get_pins {pretherm/Y13}]
set_disable_timing   [get_pins {pretherm/Y14}]
set_disable_timing   [get_pins {pretherm/Y15}]
set_max_fanout 4  [get_pins {therm1/b[3]}]
set_max_fanout 4  [get_pins {therm1/b[2]}]
set_max_fanout 4  [get_pins {therm1/b[1]}]
set_max_fanout 4  [get_pins {therm1/b[0]}]
set_load -pin_load -max  0.5  [get_ports {b[3]}]
set_load -pin_load -min  0.5  [get_ports {b[3]}]
set_load -pin_load -max  0.5  [get_ports {b[2]}]
set_load -pin_load -min  0.5  [get_ports {b[2]}]
set_load -pin_load -max  0.5  [get_ports {b[1]}]
set_load -pin_load -min  0.5  [get_ports {b[1]}]
set_load -pin_load -max  0.5  [get_ports {b[0]}]
set_load -pin_load -min  0.5  [get_ports {b[0]}]
set_input_delay -add_delay 0.015 -max -clock [get_clocks {clk}] [get_pins {therm1/Y[7]}]
set_input_delay -add_delay 0.015 -max -clock [get_clocks {clk}] [get_pins {therm1/Y[5]}]
set_input_delay -add_delay 0.015 -max -clock [get_clocks {clk}] [get_pins {therm1/Y[13]}]
set_input_delay -add_delay 0.015 -max -clock [get_clocks {clk}] [get_pins {therm1/Y[3]}]
set_input_delay -add_delay 0.015 -max -clock [get_clocks {clk}] [get_pins {therm1/Y[11]}]
set_input_delay -add_delay 0.015 -max -clock [get_clocks {clk}] [get_pins {therm1/Y[1]}]
set_input_delay -add_delay 0.015 -max -clock [get_clocks {clk}] [get_ports {rst}]
set_input_delay -add_delay 0.015 -max -clock [get_clocks {clk}] [get_pins {therm1/Y[8]}]
set_input_delay -add_delay 0.015 -max -clock [get_clocks {clk}] [get_pins {therm1/Y[6]}]
set_input_delay -add_delay 0.015 -max -clock [get_clocks {clk}] [get_pins {therm1/Y[14]}]
set_input_delay -add_delay 0.015 -max -clock [get_clocks {clk}] [get_pins {therm1/Y[4]}]
set_input_delay -add_delay 0.015 -max -clock [get_clocks {clk}] [get_pins {therm1/Y[12]}]
set_input_delay -add_delay 0.015 -max -clock [get_clocks {clk}] [get_pins {therm1/Y[2]}]
set_input_delay -add_delay 0.015 -max -clock [get_clocks {clk}] [get_pins {therm1/Y[10]}]
set_input_delay -add_delay 0.015 -max -clock [get_clocks {clk}] [get_pins {therm1/Y[0]}]
set_input_delay -add_delay 0.015 -max -clock [get_clocks {clk}] [get_pins {therm1/Y[9]}]
set_output_delay -add_delay 0.015 -min -clock [get_clocks {clk}] [get_ports {b[2]}]
set_output_delay -add_delay 0.02 -max -clock [get_clocks {clk}] [get_ports {b[2]}]
set_output_delay -add_delay 0.015 -min -clock [get_clocks {clk}] [get_ports {b[0]}]
set_output_delay -add_delay 0.02 -max -clock [get_clocks {clk}] [get_ports {b[0]}]
set_output_delay -add_delay 0.015 -min -clock [get_clocks {clk}] [get_ports {b[3]}]
set_output_delay -add_delay 0.02 -max -clock [get_clocks {clk}] [get_ports {b[3]}]
set_output_delay -add_delay 0.015 -min -clock [get_clocks {clk}] [get_ports {b[1]}]
set_output_delay -add_delay 0.02 -max -clock [get_clocks {clk}] [get_ports {b[1]}]
set_clock_uncertainty 0.04 -hold [get_clocks {clk}]
set_clock_uncertainty 0.07 -setup [get_clocks {clk}]
set_false_path  -from [get_ports {rst IN}]  -to [get_ports {b[3] b[2] b[1] b[0]}] 
set_false_path  -through [get_pins {pretherm/IN pretherm/Y01 pretherm/Y02 pretherm/Y03 pretherm/Y04 pretherm/Y05 pretherm/Y06 pretherm/Y07 pretherm/Y08 pretherm/Y09 pretherm/Y10 pretherm/Y11 pretherm/Y12 pretherm/Y13 pretherm/Y14 pretherm/Y15}] 
